learn-coco-vm/02-PyObject.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>The Very Beginning of Object: <code>PyObject.h</code></title>
<!-- 2016-03-06 周日 11:13 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Chen Zhou" />
</head>
<body>
<div id="content">
<h1 class="title">The Very Beginning of Object: <code>PyObject.h</code></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. The header file</a></li>
</ul>
</div>
</div>
<p>
This note focuses on how Python Object is implemented. Python is an
object-oriented language, everything in this language (almost?) is an
object, including "int", "float", "string". Even "type" is an object.
</p>

<p>
The textbook <i>Foundations of Programming Language</i> has a nice figure
(Fig.4.68) illustrating the CoCo type hierarchy.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> The header file</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-c++">#ifndef PYOBJECT_H_
#define PYOBJECT_H_

#include &lt;string&gt;
#include &lt;unordered_map&gt;
#include &lt;vector&gt;
#include &lt;iostream&gt;

using namespace std;

class PyType;

class PyObject {
public:
    PyObject();
    virtual ~PyObject();
    virtual PyType* getType();
    virtual string toString();
    void decRef();
    void incRef();
    int getRefCount() const;    // TODO: Explain these three `ref` functions.

    PyObject* callMethod(string name, vector&lt;PyObject*&gt;* args);

protected:
    unordered_map&lt;string,
		  PyObject* (PyObject::*)(vector&lt;PyObject*&gt;*)&gt;
    dict;                       // TODO: Explain this.

    int refCount;

    virtual PyObject* __str__(vector&lt;PyObject*&gt;* args);
    virtual PyObject* __type__(vector&lt;PyObject*&gt;* args);
};

ostream&amp; operator &lt;&lt; (ostream&amp; os, PyObject&amp; t); // TODO: Explain this.

extern bool verbose;            // TODO: Explain `extern`.

#endif
</pre>
</div>

<p>
The header file just defined a <code>PyObject</code> class and claimed a <code>PyType</code>
class. The class <code>PyObject</code> has virtual methods <code>getType</code> and
<code>toString</code>, so the classes inherited from it can use their own
specific implementation.
</p>

<p>
There are three functions about <code>Ref</code>. I believe they are used by a
garbage manager in somewhere.
</p>

<p>
The most important method is the <code>callMethod</code> which needs a string and
a pointer to a vector of pointers to <code>PyObject</code>. Everything is an
object, so are the arguments.
</p>

<p>
The most important property of <code>PyObject</code> is the <code>unordered_map</code> which
are responsible to keep records of every Python object's
property. This <code>unordered_map</code> use string as its key, the
corresponding value is a function pointer which points to the
<code>PyObject</code> member function. So under the hood, <code>PyObject</code> is just
<code>unordered_map</code>.
</p>

<p>
The private methods <code>__str__</code> and <code>__type__</code> have no obvious usage here.
</p>
<p>
The CoCo VM also overloaded operator <code>&lt;&lt;</code> for <code>PyObject</code>, so we can
just print a <code>PyObject</code> by <code>std::cout</code>.
</p>

<p>
The last code in this header file is a global variable <code>verbose</code> which
we have met in the <code>main.cpp</code>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Chen Zhou</p>
<p class="date">Created: 2016-03-06 周日 11:13</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.50.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
